; domain
;; Cave Diving STRIPS
;; Authors: Nathan Robinson,
;;          Christian Muise, and
;;          Charles Gretton

(define (domain cave-diving-strips)
  (:requirements :typing)
  (:types location diver tank quantity)
  (:predicates
    (at-tank ?t - tank ?l - location)
    (in-storage ?t - tank)
    (full ?t - tank)
    (next-tank ?t1 - tank ?t2 - tank)
    (at-diver ?d - diver ?l - location)
    (available ?d - diver)
    (at-surface ?d - diver)
    (decompressing ?d - diver)
    (cave-entrance ?l - location)
    (connected ?l1 - location ?l2 - location)
    (next-quantity ?q1 - quantity ?q2 - quantity)
    (holding ?d - diver ?t - tank)
    (capacity ?d - diver ?q - quantity)
    (have-photo ?l - location)
    (in-water )
  )

  (:constants
    d0 d1 - diver
  )

  (:action hire-diver-d0
    :parameters ( )
    :precondition (and (available d0))
    :effect (and (at-surface d0)
                 (not (available d0))
            )
  )

  (:action hire-diver-d1
    :parameters ( )
    :precondition (and (available d1))
    :effect (and (at-surface d1)
                 (not (available d1))
            )
  )

  (:action prepare-tank
    :parameters (?d - diver ?t1 ?t2 - tank ?q1 ?q2 - quantity)
    :precondition (and (at-surface ?d)
                       (in-storage ?t1)
                       (next-quantity ?q1 ?q2)
                       (capacity ?d ?q2)
                       (next-tank ?t1 ?t2)
                  )
    :effect (and (not (in-storage ?t1))
                 (not (capacity ?d ?q2))
                      (in-storage ?t2)
                      (full ?t1)
                      (capacity ?d ?q1)
                      (holding ?d ?t1)
            )
  )

  (:action enter-water
    :parameters (?d - diver ?l - location)
    :precondition (and (at-surface ?d)
                       (cave-entrance ?l)
                  )
    :effect (and (not (at-surface ?d))
                      (at-diver ?d ?l)
            )
  )

  (:action pickup-tank
    :parameters (?d - diver ?t - tank ?l - location ?q1 ?q2 - quantity)
    :precondition (and (at-diver ?d ?l)
                       (at-tank ?t ?l)
                       (next-quantity ?q1 ?q2)
                       (capacity ?d ?q2)
                  )
    :effect (and (not (at-tank ?t ?l))
                 (not (capacity ?d ?q2))
                      (holding ?d ?t)
                      (capacity ?d ?q1)
            )
  )

  (:action drop-tank
    :parameters (?d - diver ?t - tank ?l - location ?q1 ?q2 - quantity)
    :precondition (and (at-diver ?d ?l)
                       (holding ?d ?t)
                       (next-quantity ?q1 ?q2)
                       (capacity ?d ?q1)
                  )
    :effect (and (not (holding ?d ?t))
                 (not (capacity ?d ?q1))
                      (at-tank ?t ?l)
                      (capacity ?d ?q2)
            )
  )

  (:action swim
    :parameters (?d - diver ?t - tank ?l1 ?l2 - location)
    :precondition (and (at-diver ?d ?l1)
                       (holding ?d ?t)
                       (full ?t)
                       (connected ?l1 ?l2)
                  )
    :effect (and (not (at-diver ?d ?l1))
                 (not (full ?t))
                      (at-diver ?d ?l2)
            )
  )

  (:action photograph
    :parameters (?d - diver ?l - location ?t - tank)
    :precondition (and (at-diver ?d ?l)
                       (holding ?d ?t)
                       (full ?t)
                  )
    :effect (and (not (full ?t))
                      (have-photo ?l)
            )
  )

  (:action decompress
    :parameters (?d - diver ?l - location)
    :precondition (and (at-diver ?d ?l)
                       (cave-entrance ?l)
                  )
    :effect (and (not (at-diver ?d ?l))
                      (decompressing ?d)
                 (not (in-water))
            )
  )

)

; problem
;; Cave Diving STRIPS
;; Authors: Nathan Robinson,
;;          Christian Muise, and
;;          Charles Gretton

(define (problem cave-diving-strips-satprob01)
  (:domain cave-diving-strips)
  (:objects
    l0 l1 l2 - location
    t0 t1 t2 t3 t4 t5 t6 dummy - tank
    zero one two three four - quantity
  )

  (:init
    (available d0)
    (available d1)
    (capacity d0 four)
    (capacity d1 four)
    (in-storage t0)
    (next-tank t0 t1)
    (next-tank t1 t2)
    (next-tank t2 t3)
    (next-tank t3 t4)
    (next-tank t4 t5)
    (next-tank t5 t6)
    (next-tank t6 dummy)
    (cave-entrance l0)
    (connected l0 l1)
    (connected l1 l0)
    (connected l1 l2)
    (connected l2 l1)
    (next-quantity zero one)
    (next-quantity one two)
    (next-quantity two three)
    (next-quantity three four)
  )

  (:goal
    (and
      (have-photo l2)
      (decompressing d0)
      (decompressing d1)
    )
  )

)

; plan
1. (hire-diver-d1)
   deleted: (available d1)
   added: (at-surface d1)
   goals met: 0 of 3
2. (hire-diver-d0)
   deleted: (available d0)
   added: (at-surface d0)
   goals met: 0 of 3
3. (prepare-tank d1 t0 t1 three four)
   deleted: (in-storage t0) (capacity d1 four)
   added: (in-storage t1) (full t0) (capacity d1 three) (holding d1 t0)
   goals met: 0 of 3
4. (prepare-tank d1 t1 t2 two three)
   deleted: (in-storage t1) (capacity d1 three)
   added: (in-storage t2) (full t1) (capacity d1 two) (holding d1 t1)
   goals met: 0 of 3
5. (prepare-tank d0 t2 t3 three four)
   deleted: (in-storage t2) (capacity d0 four)
   added: (in-storage t3) (full t2) (capacity d0 three) (holding d0 t2)
   goals met: 0 of 3
6. (prepare-tank d1 t3 t4 one two)
   deleted: (in-storage t3) (capacity d1 two)
   added: (in-storage t4) (full t3) (capacity d1 one) (holding d1 t3)
   goals met: 0 of 3
7. (prepare-tank d0 t4 t5 two three)
   deleted: (in-storage t4) (capacity d0 three)
   added: (in-storage t5) (full t4) (capacity d0 two) (holding d0 t4)
   goals met: 0 of 3
8. (prepare-tank d0 t5 t6 one two)
   deleted: (in-storage t5) (capacity d0 two)
   added: (in-storage t6) (full t5) (capacity d0 one) (holding d0 t5)
   goals met: 0 of 3
9. (prepare-tank d0 t6 dummy zero one)
   deleted: (in-storage t6) (capacity d0 one)
   added: (in-storage dummy) (full t6) (capacity d0 zero) (holding d0 t6)
   goals met: 0 of 3
10. (enter-water d1 l0)
   deleted: (at-surface d1)
   added: (at-diver d1 l0)
   goals met: 0 of 3
11. (swim d1 t0 l0 l1)
   deleted: (at-diver d1 l0) (full t0)
   added: (at-diver d1 l1)
   goals met: 0 of 3
12. (enter-water d0 l0)
   deleted: (at-surface d0)
   added: (at-diver d0 l0)
   goals met: 0 of 3
13. (swim d0 t4 l0 l1)
   deleted: (at-diver d0 l0) (full t4)
   added: (at-diver d0 l1)
   goals met: 0 of 3
14. (swim d0 t6 l1 l2)
   deleted: (at-diver d0 l1) (full t6)
   added: (at-diver d0 l2)
   goals met: 0 of 3
15. (drop-tank d0 t6 l2 zero one)
   deleted: (holding d0 t6) (capacity d0 zero)
   added: (at-tank t6 l2) (capacity d0 one)
   goals met: 0 of 3
16. (photograph d0 l2 t5)
   deleted: (full t5)
   added: (have-photo l2)
   goals met: 1 of 3
17. (drop-tank d1 t0 l1 one two)
   deleted: (holding d1 t0) (capacity d1 one)
   added: (at-tank t0 l1) (capacity d1 two)
   goals met: 1 of 3
18. (swim d0 t2 l2 l1)
   deleted: (at-diver d0 l2) (full t2)
   added: (at-diver d0 l1)
   goals met: 1 of 3
19. (drop-tank d1 t3 l1 two three)
   deleted: (holding d1 t3) (capacity d1 two)
   added: (at-tank t3 l1) (capacity d1 three)
   goals met: 1 of 3
20. (pickup-tank d0 t3 l1 zero one)
   deleted: (at-tank t3 l1) (capacity d0 one)
   added: (holding d0 t3) (capacity d0 zero)
   goals met: 1 of 3
21. (swim d1 t1 l1 l0)
   deleted: (at-diver d1 l1) (full t1)
   added: (at-diver d1 l0)
   goals met: 1 of 3
22. (swim d0 t3 l1 l0)
   deleted: (at-diver d0 l1) (full t3)
   added: (at-diver d0 l0)
   goals met: 1 of 3
23. (decompress d0 l0)
   deleted: (at-diver d0 l0)
   added: (decompressing d0)
   goals met: 2 of 3
24. (decompress d1 l0)
   deleted: (at-diver d1 l0)
   added: (decompressing d1)
   goals met: 3 of 3
